## ✅ `tofu plan` output pour `scripts/tofu/live/ci-cd-permissions`
```module.oidc_provider.data.tls_certificate.github: Reading...
module.oidc_provider.data.tls_certificate.github: Read complete after 0s [id=772ed8785f2c647baa040d3a1b4aa6cafacb6267]
module.iam_roles.data.aws_iam_policy_document.plan_serverless_app[0]: Reading...
module.iam_roles.data.aws_iam_policy_document.test_serverless_app[0]: Reading...
module.iam_roles.data.aws_iam_policy_document.apply_serverless_app[0]: Reading...
module.iam_roles.data.aws_iam_policy_document.plan_serverless_app[0]: Read complete after 0s [id=1115049349]
module.iam_roles.data.aws_iam_policy_document.test_serverless_app[0]: Read complete after 0s [id=3820614302]
module.iam_roles.data.aws_iam_policy_document.apply_serverless_app[0]: Read complete after 0s [id=2988753755]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.iam_roles.data.aws_iam_policy_document.assume_role_policy_for_apply[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_policy_for_apply" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "repo:FelixESIEE2024/lab5:ref:refs/heads/main",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam_roles.data.aws_iam_policy_document.assume_role_policy_for_plan[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_policy_for_plan" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:FelixESIEE2024/lab5:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam_roles.data.aws_iam_policy_document.assume_role_policy_for_tests[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_policy_for_tests" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:FelixESIEE2024/lab5:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam_roles.aws_iam_role.lambda_deploy_apply[0] will be created
  + resource "aws_iam_role" "lambda_deploy_apply" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-sample-apply"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam_roles.aws_iam_role.lambda_deploy_plan[0] will be created
  + resource "aws_iam_role" "lambda_deploy_plan" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-sample-plan"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam_roles.aws_iam_role.lambda_tests[0] will be created
  + resource "aws_iam_role" "lambda_tests" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-sample-tests"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam_roles.aws_iam_role_policy.apply_serverless_app[0] will be created
  + resource "aws_iam_role_policy" "apply_serverless_app" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:UpdateRole",
                          + "iam:PutRolePolicy",
                          + "iam:PassRole",
                          + "iam:List*Role*",
                          + "iam:Get*Role*",
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:DeleteRole",
                          + "iam:CreateRole",
                          + "iam:AttachRolePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/lambda-sample*"
                      + Sid      = "IamPermissions"
                    },
                  + {
                      + Action   = [
                          + "lambda:*",
                          + "apigatewayv2:*",
                          + "apigateway:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ServerlessPermissions"
                    },
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::devops-td5-tofu-state-felix-test-depuis-git/*",
                          + "arn:aws:s3:::devops-td5-tofu-state-felix-test-depuis-git",
                        ]
                      + Sid      = "TofuStateS3Permissions"
                    },
                  + {
                      + Action   = "dynamodb:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:*:table/devops-td5-tofu-state-felix-test-depuis-git"
                      + Sid      = "TofuStateDynamoPermissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam_roles.aws_iam_role_policy.plan_serverless_app[0] will be created
  + resource "aws_iam_role_policy" "plan_serverless_app" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:List*Role*",
                          + "iam:Get*Role*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/lambda-sample*"
                      + Sid      = "IamReadOnlyPermissions"
                    },
                  + {
                      + Action   = [
                          + "lambda:List*",
                          + "lambda:Get*",
                          + "apigatewayv2:Get*",
                          + "apigateway:GET",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ServerlessReadOnlyPermissions"
                    },
                  + {
                      + Action   = [
                          + "s3:List*",
                          + "s3:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::devops-td5-tofu-state-felix-test-depuis-git/*",
                          + "arn:aws:s3:::devops-td5-tofu-state-felix-test-depuis-git",
                        ]
                      + Sid      = "TofuStateS3ReadOnlyPermissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam_roles.aws_iam_role_policy.test_serverless_app[0] will be created
  + resource "aws_iam_role_policy" "test_serverless_app" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:PutRolePolicy",
                          + "iam:PassRole",
                          + "iam:GetRole",
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRole",
                          + "iam:CreateRole",
                          + "iam:AttachRolePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/lambda-sample*"
                      + Sid      = "IamPermissions"
                    },
                  + {
                      + Action   = [
                          + "lambda:*",
                          + "apigatewayv2:*",
                          + "apigateway:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ServerlessPermissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.oidc_provider.aws_iam_openid_connect_provider.github_actions will be created
  + resource "aws_iam_openid_connect_provider" "github_actions" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "2b18947a6a9fc7764fd8b5fb18a863b0c6dac24f",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lambda_deploy_apply_role_arn = (known after apply)
  + lambda_deploy_plan_role_arn  = (known after apply)
  + lambda_test_role_arn         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```